Revit 2024 API
UIMacroManager Class
 The UI macro manager to support Macro operations related to the sharp develop IDE.
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUIMacros (in RevitAPIUIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class UIMacroManager : IDisposable
Visual Basic
Public Class UIMacroManager _
	Implements IDisposable
Visual C++
public ref class UIMacroManager : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.Macros.UIMacroManager
See Also
UIMacroManager Members
Autodesk.Revit.UI.Macros Namespace